linux81/STM32F103C8T6/main7.c
#include "stm32f10x.h" 
#include "system.h"
#include "delay.h"

int main (void){

SystemInit();
	// PA9 USART1 TX, PA10 USART1 RX, DIODA PC13, PA1 TIM2 CH2, PA7 TIM3 CH2, PB7 TIM4 CH2
RCC->APB2ENR |= RCC_APB2ENR_IOPAEN|RCC_APB2ENR_IOPBEN|RCC_APB2ENR_USART1EN |RCC_APB2ENR_IOPCEN|RCC_APB2ENR_AFIOEN;
RCC->APB1ENR |= RCC_APB1ENR_TIM2EN|RCC_APB1ENR_TIM3EN|RCC_APB1ENR_TIM4EN;
USART1->BRR     = 72000000/9600; 
USART1->CR1    |= USART_CR1_TE | USART_CR1_RE|USART_CR1_UE|USART_CR1_RXNEIE;      // Enable UART for TX, RX

NVIC_EnableIRQ(USART1_IRQn);
// PA1 TIM2 CH2, PA7 TIM3 CH2
GPIOA->CRL=GPIO_CRL_MODE1_1|GPIO_CRL_CNF1_1|GPIO_CRL_MODE7_1|GPIO_CRL_CNF7_1;

// PB7 TIM4 CH2
GPIOB->CRL=GPIO_CRL_MODE7_1|GPIO_CRL_CNF7_1;
// PA9, PA10 USART1
GPIOA->CRH=GPIO_CRH_MODE9_1|GPIO_CRH_CNF9_1|GPIO_CRH_CNF10_0;
GPIOC->CRH=GPIO_CRH_MODE13_1;
	
  TIM2->PSC = 1;
  TIM2->ARR =15000;
	TIM2->CCR2 = 7500; // Compare 1 with 250
	TIM2->CR2 |= TIM_CR2_MMS_0|TIM_CR2_MMS_2;


  TIM2->CCMR1 |= TIM_CCMR1_OC2M; // Toggle output 1 & 2 on compare match

  TIM2->CCER |= TIM_CCER_CC2E;
	
	TIM3->PSC = 1;
  TIM3->ARR =15000;
	TIM3->CCR2 = 7500; // Compare 1 with 250
	TIM3->CR2 |= TIM_CR2_MMS_0|TIM_CR2_MMS_2;
	TIM3->SMCR |= TIM_SMCR_TS_0|TIM_SMCR_SMS_2; 


  TIM3->CCMR1 |= TIM_CCMR1_OC2M; // Toggle output 1 & 2 on compare match

  TIM3->CCER |= TIM_CCER_CC2E;
	
	TIM4->PSC = 1;
  TIM4->ARR =15000;
	TIM4->CCR2 = 7500; // Compare 1 with 250
	TIM4->SMCR |= TIM_SMCR_TS_1|TIM_SMCR_SMS_2; 


  TIM4->CCMR1 |= TIM_CCMR1_OC2M; // Toggle output 1 & 2 on compare match

  TIM4->CCER |= TIM_CCER_CC2E;
	
	
	
  TIM2->CR1 |= TIM_CR1_CEN; // Enable timer
	
	TIM3->CR1 |= TIM_CR1_CEN;
	
	TIM4->CR1 |= TIM_CR1_CEN;

	
while(1){
	GPIOC->BSRR=GPIO_BSRR_BR13;
	Delay(1000);
	
	GPIOC->BSRR=GPIO_BSRR_BS13;
	Delay(1000);


}


}


void USART1_IRQHandler(void)
{ if ( USART1->SR & USART_SR_RXNE){
uint8_t tmp;
	USART1->SR &= ~USART_SR_RXNE;

	tmp=USART1->DR;
	
	if (tmp=='a'){TIM2->CCR2 +=500;TIM3->CCR2 +=500;TIM4->CCR2 +=500;};
	if (TIM2->CCR2==1500){TIM2->CCR2 =500;};
	if (TIM3->CCR2==1500){TIM3->CCR2 =500;};
	if (TIM4->CCR2==1500){TIM4->CCR2 =500;};
	if (tmp=='b'){TIM2->CCR2 -=500;TIM3->CCR2 -=500;TIM4->CCR2 -=500;};
	if (TIM2->CCR2==0){TIM2->CCR2 =15000;};
	if (TIM3->CCR2==0){TIM3->CCR2 =15000;};
	if (TIM4->CCR2==0){TIM4->CCR2 =15000;};
	
};
};
